clear; clc; close all;

% Матрицы системы
A = [0, 1, 0, 0;
     0, 0, -0.0095, 0;
     0, 0, 0, 1;
     0, 0, 6.5197, 0];

B = [0; 0.0015; 0; -0.0010];
C = [1, 0, 0, 0;
     0, 0, 1, 0];
D = [0; -0.0010; 0; 0.0166];

% Передаточные функции по управлению u
sys_u = ss(A, B, C, zeros(2,1));
W_u_y1 = tf(sys_u(1,1))  % от u к y1 (тележка)
W_u_y2 = tf(sys_u(2,1))  % от u к y2 (угол)

% Передаточные функции по возмущению f
sys_f = ss(A, D, C, zeros(2,1));
W_f_y1 = tf(sys_f(1,1))  % от f к y1 (тележка)
W_f_y2 = tf(sys_f(2,1))  % от f к y2 (угол)

% Полюса и нули
pole(W_u_y2)
zero(W_u_y1)