clc; clear;

syms s;

%%%%%%%%
A = [-3 1; 
    -2 0];
B = [1; 9];
C = [1 0];

A0 = [-sqrt(0.32)  1;
      -0.16 0];

[num, den] = ss2tf(A, B, C, 0);
sys = tf(num, den);

% Для фильтра
I = eye(2);
v0 = [0;0];
e_Y0 = [0;1];
e_Y1 = [1;0];
e_U0 = [0;1];
e_U1 = [1; 0];

% Матрица для вычленения нечетных эл. вектора кси
C_xi = [1 0 0 0 0 0 0 0;
          0 0 1 0 0 0 0 0;
          0 0 0 0 1 0 0 0;
          0 0 0 0 0 0 1 0];

%
gamma = 500;

teta = [0.16 - 2; sqrt(0.32) - 3; 9; 1];



syms t w
f = sin(8*t) + cos(8*t) + 1 + sin(2*t) + sin(4*t)*cos(7*t)*sin(11*t);         % задаем функцию
F = fourier(f, t, w);
% disp(F);
pretty(F) 